[
  {
    "title": "Replying to an ex’s story",
    "category": "loyalty",
    "fullText": "Someone replies to their ex’s story with a friendly message that isn’t flirty but feels familiar. They don’t hide it, but they also don’t mention it. Do you think this is harmless or something worth talking about?",
    "tags": ["loyalty", "boundaries"]
  },
  {
    "title": "Phone always face-down",
    "category": "boundaries",
    "fullText": "A person always keeps their phone face-down when they're with someone they're dating. They say it's just a habit. Do you think this usually signals normal privacy or something more concerning?",
    "tags": ["boundaries", "loyalty"]
  },
  {
    "title": "Flirty behavior at a party",
    "category": "boundaries",
    "fullText": "At a party, someone is being flirty with the person you're dating. That person doesn’t flirt back but also doesn’t shut it down—they just laugh it off. In your opinion, is ignoring it enough or should they address it?",
    "tags": ["boundaries", "loyalty"]
  },
  {
    "title": "Last-minute weekend plans",
    "category": "boundaries",
    "fullText": "Someone makes weekend plans with friends and only mentions it at the last minute. They didn’t hide it—just didn’t think it was important. Do you see this as inconsiderate or completely normal?",
    "tags": ["boundaries"]
  },
  {
    "title": "Delay in replying while active online",
    "category": "loyalty",
    "fullText": "A person takes several hours to reply even though they've been active online. When they respond, they act casual. Do you think this has an innocent explanation or suggests something deeper?",
    "tags": ["loyalty", "boundaries"]
  },
  {
    "title": "Keeping gifts from an ex",
    "category": "boundaries",
    "fullText": "Someone still keeps meaningful gifts, letters, or photos from their ex. They say it's just part of their past and doesn't mean anything. Do you see this as harmless or disrespectful?",
    "tags": ["boundaries", "loyalty"]
  },
  {
    "title": "Following thirst-trap creators",
    "category": "boundaries",
    "fullText": "A person follows several creators who regularly post thirst traps and likes some of those posts. They say it's just content. Do you think this is harmless or uncomfortable in a dating context?",
    "tags": ["boundaries", "loyalty"]
  },
  {
    "title": "Income difference & fairness",
    "category": "money",
    "fullText": "Two people are dating, but one earns significantly more. The higher earner still prefers splitting everything 50/50—bills, dates, trips. Does that feel fair or inconsiderate to you?",
    "tags": ["money", "boundaries"]
  },
  {
    "title": "Family influence on decisions",
    "category": "family",
    "fullText": "When a decision affects the relationship, one person tends to give more weight to their family's opinion than to the person they're seeing. Do you see this as understandable or a long-term issue?",
    "tags": ["family", "boundaries"]
  },
  {
    "title": "Uneven effort in dating",
    "category": "ambition",
    "fullText": "In a new relationship, one person initiates more conversations, plans more dates, and generally puts in more effort. The other person is warm but not proactive. Does this feel normal at first or already imbalanced?",
    "tags": ["ambition", "boundaries"]
  }
]