[
  {
    "title": "AITA for refusing to lend my sister money for her wedding?",
    "category": "Money",
    "fullText": "My sister (28F) is getting married in 6 months and asked me (26F) to loan her $15,000 for her wedding. I've been saving for a house deposit for 3 years and finally have enough. She promised to pay me back 'eventually' but has a history of not paying back loans. When I explained I needed this money for my future, she broke down crying and said I clearly don't care about her happiness. Now my entire family is calling me selfish and saying family should always come first. My mom even suggested I could 'just save up again.' AITA for prioritizing my financial goals over her wedding?",
    "tags": ["money", "family", "boundaries"]
  },
  {
    "title": "AITA for telling my boyfriend his best friend makes me uncomfortable?",
    "category": "Boundaries",
    "fullText": "I've (24F) been dating my boyfriend (25M) for 2 years. His best friend since college (24F) is very close with him and I've tried to be supportive. But she constantly makes 'jokes' about how they dated briefly freshman year, comments on how she knows him better than I do, and even joked at a party that she 'had him first.' When I finally told my boyfriend it makes me deeply uncomfortable, he said I'm being insecure and trying to control his friendships. He says she's just joking and I need to lighten up. AITA for setting this boundary?",
    "tags": ["boundaries", "relationships", "trust"]
  },
  {
    "title": "AITA for not inviting my mom to my graduation?",
    "category": "Family",
    "fullText": "I'm (27F) graduating with my PhD next month. I only get 2 guest tickets. My mom missed my high school graduation (work trip), my college graduation (another work trip), and countless birthdays and events growing up. My dad and grandma were always there for me - they supported me emotionally and financially through everything. When I told my mom I'm giving my tickets to them, she broke down saying she's tried her best and I'm punishing her for providing for the family. She's telling relatives I'm cruel and ungrateful. My dad says I should give her one ticket to 'keep the peace.' AITA for wanting the people who were actually there for me to witness this moment?",
    "tags": ["family", "priorities", "boundaries"]
  },
  {
    "title": "AITA for expecting my partner to prioritize our anniversary?",
    "category": "Loyalty",
    "fullText": "My partner (29M) and I (28F) have been together for 5 years. We planned a special anniversary trip to the cabin we first visited together - booked 4 months ago. Yesterday he told me his best friend just set his bachelor party for the same weekend and he 'has to go' because he's the best man. He suggested we reschedule our trip, but I've already taken time off work (which is hard to change) and we've paid non-refundable deposits. When I said I expected him to honor our plans, he said I'm being unfair because 'it's just one weekend' and his friend only gets married once. He thinks I'm being selfish for not understanding. AITA for expecting him to keep our anniversary commitment?",
    "tags": ["loyalty", "relationships", "priorities"]
  },
  {
    "title": "AITA for not wanting to share my promotion news yet?",
    "category": "Ambition",
    "fullText": "I (29F) just got promoted to director at my company - something I've worked toward for 7 years. My partner (30M) is excited and wants to tell both our families at dinner this weekend. But I'm superstitious and also want to prove myself in the role before making a big announcement. I've seen promotions fall through before. When I asked if we could wait a few weeks, he got upset and said I'm embarrassed of him or don't want to celebrate 'us' succeeding. He thinks I'm being paranoid and that my hesitation means I don't value his support. AITA for wanting to wait to share my career news?",
    "tags": ["ambition", "career", "communication"]
  },
  {
    "title": "AITA for setting a curfew when my partner stays over?",
    "category": "Boundaries",
    "fullText": "My partner (26M) and I (25F) don't live together. He stays at my apartment 3-4 nights a week. The issue: he's a night owl and games with his online friends until 2-3am. My bedroom walls are thin and I hear everything - the keyboard clicking, him talking, his chair squeaking. I wake up at 6am for work and I'm exhausted. I asked if he could stop gaming by midnight on work nights or maybe game at his place on those nights. He said I'm being controlling and treating him like a child with a 'curfew.' He says if I cared about him I'd just wear earpods. AITA for setting this boundary in my own home?",
    "tags": ["boundaries", "living", "respect"]
  }
]

